<?php return array (
  'public' => array (
    'retrieved' => 'Данные успешно получены',
    'stored' => 'Успешно сохранено',
    'deleted' => 'Успешно удалено',
    'updated' => 'Успешно обновлено',
    'status' => ':item: статус успешно обновлён',
    'invalid' => 'Не найдено!',
  ),
  'auth' => array (
    'not_verified' => 'Пользователь не подтверждён',
    'not_found' => 'Пользователь не найден',
    'invalid_register_method' => 'Недопустимый способ регистрации',
    'already_registered' => 'Пользователь уже зарегистрирован',
    'login' => 'Вход выполнен успешно',
    'registered' => 'Пользователь успешно зарегистрирован',
  ),
  'not_access_to_this_item' => 'У вас нет доступа к этому ресурсу',
);