app/Http/Controllers/ClickUzController.php

    public function prepare(Request $request)
    {
        $data = $request->all();
        $secretKey = config('clickuz.provider.click.secret_key');
        $generatedSignString = md5(
            "{$data['click_trans_id']}{$data['service_id']}{$secretKey}{$data['merchant_trans_id']}{$data['amount']}{$data['action']}{$data['sign_time']}"
        );
//        return response()->json(['click'=>$generatedSignString]);
        if ($data['sign_string'] !== $generatedSignString) {
            return response()->json(['error' => -1, 'error_note' => 'SIGN CHECK FAILED!']);
        }

        ClickUz::create([
            'click_trans_id' => $data['click_trans_id'],
            'merchant_trans_id' => $data['merchant_trans_id'],
            'amount' => $data['amount'],
            'sign_time' => $data['sign_time'],
            'situation' => $data['error']
        ]);
---
insert into `click_uzs` (`click_trans_id`, `merchant_trans_id`, `amount`, `sign_time`, `situation`, `updated_at`, `created_at`) values ('122121', '1', '1000', '2025-02-20 16:20:20', '0', '2025-02-20 11:31:11', '2025-02-20 11:31:11')

    public function complete(Request $request)
    {
        $data = $request->all();
        $secretKey = config('clickuz.provider.click.secret_key');
        $generatedSignString = md5(
            "{$data['click_trans_id']}{$data['service_id']}{$secretKey}{$data['merchant_trans_id']}{$data['merchant_prepare_id']}{$data['amount']}{$data['action']}{$data['sign_time']}"
        );
//        return response()->json(['click'=>$generatedSignString]);

        if ($data['sign_string'] !== $generatedSignString) {
            return response()->json(['error' => -1, 'error_note' => 'SIGN CHECK FAILED!']);
        }
        ClickUz::where('click_trans_id', $data['click_trans_id'])->update([
            'situation' => $data['error']==0 ? 1 : -9,
            'status' => $data['error']==0 ? 'success' : 'Transaction cancelled'
        ]);
        Order::where('id', $data['merchant_trans_id'])->update(['status' => 'paid']);
---
update `click_uzs` set `situation` = 1, `status` = 'success', `click_uzs`.`updated_at` = '2025-02-26 10:01:01' where `click_trans_id` = '122121'
update `orders` set `status` = 'paid' where `id` = '731'